FemDesign.Calculate.Application
This is a simple "application" for fd3dstruct.
Retreive process information of a running fd3dstruct.
Start and run processes (open, analysis, design etc.

FemDesign.Calculate.Application.FdPath
Path to fd3dstruct.

FemDesign.Calculate.Application.FdVersion
Version of running fd3dstruct process.

FemDesign.Calculate.Application.FdTargetVersion
Target version of class library.

FemDesign.Calculate.Application.GetProcessInformation
Retreive process information of a running fd3dstruct process.

FemDesign.Calculate.Application.KillProcesses
Force shutdown of any running fd3dstruct processes.

FemDesign.Calculate.Application.CheckProcess
Check if a fd3dstruct process is running.

FemDesign.Calculate.Application.IsRunning
Check if a fd3dstruct process is running.

FemDesign.Calculate.Application.GetOpenFileNames
Get a list of all files open in a fd3dstruct process.

FemDesign.Calculate.Application.CheckOpenFiles(System.Collections.Generic.List{System.String})
Check if any of the files are open in femdesign already.
filenames: The files to check if already opened.

FemDesign.Calculate.Application.OpenStruxml(System.String,System.Boolean)
Open a .struxml file in fd3dstruct.
struxmlPath:
killProcess:

FemDesign.Calculate.Application.RunFdScript(FemDesign.Calculate.FdScript,System.Boolean,System.Boolean,System.Boolean)
Run fd3dstruct with a .fdscript.
fdScript:
killProcess:
endSession:
Returns:

FemDesign.Calculate.Application.RunFdScript(System.String,System.Boolean,System.Boolean)
Run fd3dstruct with a .fdscript.
fdScriptPath: Path to an FdScript
killProcess:
endSession:
Returns: